tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Application launcher and productivity software
cask "alfred"
# Web browser focusing on privacy
cask "brave-browser"
# Git client focusing on productivity
cask "gitkraken"
# Keyboard customizer
cask "karabiner-elements"
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
mas "WeChat", id: 836500024
vscode "andrejunges.Handlebars"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "CoenraadS.bracket-pair-colorizer-2"
vscode "cschlosser.doxdocgen"
vscode "dbankier.vscode-quick-select"
vscode "deerawan.vscode-faker"
vscode "dharmey.timer"
vscode "DigitalBrainstem.javascript-ejs-support"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "GitHub.codespaces"
vscode "heybourn.headwind"
vscode "JakeWilson.vscode-cdnjs"
vscode "kaiwood.center-editor-window"
vscode "mattpocock.ts-error-translator"
vscode "moalamri.inline-fold"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "Orta.vscode-twoslash-queries"
vscode "pmndrs.pmndrs"
vscode "Prisma.prisma"
vscode "ritwickdey.LiveServer"
vscode "SimonSiefke.svg-preview"
vscode "Tyriar.lorem-ipsum"
vscode "vincaslt.highlight-matching-tag"
vscode "xabikos.JavaScriptSnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
