tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pack, ship and run any application as a lightweight container
brew "exa"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Platform built on V8 to build network applications
brew "node"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Open source relational database management system
brew "mysql"
# Fast, disk space efficient package manager
brew "pnpm"
# Theme for zsh
brew "powerlevel10k"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Web browser focusing on privacy
cask "brave-browser"
# Client for the Dropbox cloud storage service
cask "dropbox"
# System-wide audio equalizer
cask "eqmac"
# Web browser
cask "firefox"
# Menu bar app to monitor graphics card usage
cask "gfxcardstatus"
# Git client focusing on productivity
cask "gitkraken"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# App to write, plan, collaborate, and get organized
cask "notion"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
vscode "alefragnani.project-manager"
vscode "andrejunges.Handlebars"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "CoenraadS.bracket-pair-colorizer-2"
vscode "cschlosser.doxdocgen"
vscode "dbankier.vscode-quick-select"
vscode "deerawan.vscode-faker"
vscode "dharmey.timer"
vscode "DigitalBrainstem.javascript-ejs-support"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "GitHub.codespaces"
vscode "heybourn.headwind"
vscode "JakeWilson.vscode-cdnjs"
vscode "kaiwood.center-editor-window"
vscode "mattpocock.ts-error-translator"
vscode "moalamri.inline-fold"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "Orta.vscode-twoslash-queries"
vscode "pmndrs.pmndrs"
vscode "Prisma.prisma"
vscode "ritwickdey.LiveServer"
vscode "SimonSiefke.svg-preview"
vscode "Tyriar.lorem-ipsum"
vscode "vincaslt.highlight-matching-tag"
vscode "xabikos.JavaScriptSnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
